<div style="text-align: center;">
<h1>The University of North Carolina at Chapel Hill</h1>
<h1>Comp 521 Files and Databases - Fall 2016</h1>
<h1 style="font-size: 250%;">Problem Set #2</h1>
<h1 style="font-size: 200%;">Version 1.1</h1>
<h1>Issued Friday 09/16/2016; Due Monday 09/26/2016</h1>
</div>

**Homework Information:** The answer cells in this notebook contain metadata that enable it to be automatically parsed. Thus, you must enter your answers *only* into the cells provided. Do not delete any answer cell and/or add a new one to replace it. If you do so by accident, download a new copy of the problem set's notebook and transfer your answers into it. You can introduce new 'coding' cells in an effort to test your approaches to problems, however, these introduced cells will not be considered when grading.

Finally, some of the problems are probably too long to be done the night before the due date, so plan accordingly. Late problem sets will be penalized by a factor of 70.71% for each class meeting after their due date. Feel free to get help from others, but the work you submit in should be your own.

In [3]:
# Do not make any edits in this cell!
class Student:
    first = "James"
    last = "Barbour"
    onyen = "jebarbou"
    pid = "720076615"

In the following questions you are asked to write a single SQL query to find the requested results from the Movies data described in problem set #1.
 <table style="border:none;"><tbody>
        <tr style="border:none;">
            <td style="padding:0px 20px;border:none;">
            <table><tbody>
            <tr><th colspan="6" style="text-align:center;">Movies</th></tr>
            <tr><td><u>mid</u></td>
                <td>title</td>
                <td>releasedate</td>
                <td>runtime</td>
                <td>revenue</td>
                <td>budget</td>
            </tr>
            </tbody></table>
            </td>
            <td style="padding:0px 20px;border:none;">
            <table><tbody>
            <tr><th colspan="4" style="text-align:center;">Cast</th></tr>
            <tr><td><u>mid</u></td>
                <td><u>billing</u></td>
                <td><u>aid</u></td>
                <td>role</td>
            </tr>
            </tbody></table>
            </td>
            <td style="padding:0px 20px;border:none;">
            <table><tbody>
            <tr><th colspan="4" style="text-align:center;">Actors</th></tr>
            <tr><td><u>aid</u></td>
                <td>name</td>
                <td>gender</td>
                <td>birthdate</td>
            </tr>
            </tbody></table>
            </td>
        </tr>
        </tbody></table>

An <a href="http://csbio.unc.edu/mcmillan/Media/movies.db" download>example database</a> and the interactive SQL parser (<a href="http://csbio.unc.edu/mcmillan/Media/iSQL.zip" download>iSQL.zip</a>) are provided for experimentation. You will need to unzip and copy iSQL.py into the same directory as the notebook for this problem set and invoke it as follows:


    import iSQL
    
    query = iSQL.parser("movies.db")
    </code>
    

Make sure that you copy your final SQL query into the cell provided for your answer. Only that cell will be graded.
***Warning***, if your query appears to give the correct result for the given database, that does not mean that it is correct. A correct query must give the requested result for *any* and *all* valid instances of the given database schema.

---
**Problem 1:** Find the titles and release dates of all movies for which "Superman" appears in the title (Hint: You should "like" Superman):

SELECT M.title, M.release
FROM  Movies M
WHERE M.title LIKE "%Superman%"

---
**Problem 2:** Find the titles of movies that include a character called "Superman", that do not include the word "Superman" in their title:

SELECT M.title
FROM  Movies M
WHERE M.mid IN  (SELECT DISTINCT C.mid
    FROM Cast C
    WHERE C.role LIKE "%Superman%")
and M.title NOT LIKE "%Superman%"

---
**Problem 3:** Find the titles of movies that include characters called "Superman" and "Lois Lane" in their credits:

SELECT M.title
FROM  Movies M
WHERE M.mid IN (SELECT C.mid
    FROM Cast C
    WHERE C.role LIKE "%Lois Lane%"
    INTERSECT
    SELECT C.mid
    FROM Cast C
    WHERE C.role LIKE "%Superman%")

---
**Problem 4:** Find the names of actors that played characters called "Superman" and "Lois Lane" in the same Movie:

SELECT DISTINCT L.name, S.name
FROM (((SELECT *
    FROM Cast C
    WHERE C.role LIKE "%Lois Lane%")
    JOIN Actors USING (aid)) as L
    JOIN
    ((SELECT *
    FROM Cast C
    WHERE C.role LIKE "%Superman%")
    JOIN Actors USING (aid)) as S
    USING (mid))

---
**Problem 5:** Find the titles of movies that include characters called "Superman" and "Lex Luthor" and "Jimmy Olsen":

SELECT M.title
FROM  Movies M
WHERE M.mid IN (SELECT C.mid
    FROM Cast C
    WHERE C.role LIKE "%Superman%"
    INTERSECT
    SELECT C.mid
    FROM Cast C
    WHERE C.role LIKE "%Lex Luthor%"
    INTERSECT
    SELECT C.mid
    FROM Cast C
    WHERE C.role LIKE "%Jimmy Olsen%")

---
**Problem 6:** Find the filmography of the Actor named "Henry Cavill" in chronological order:

SELECT M.title
FROM  Movies M
WHERE M.mid IN (SELECT C.mid
    FROM Cast C
    WHERE C.aid in (
        SELECT A.aid
        FROM Actors A
        WHERE A.name = "Henry Cavill"))
ORDER BY M.release ASC

---
**Problem 7:** What is the largest revenue of any movie staring "Brad Pitt" (i.e. where he had top-billing)?

SELECT MAX(M.revenue)
FROM  Movies M
WHERE M.mid IN (SELECT C.mid
    FROM Cast C
    WHERE C.billing = 1 AND C.aid in (
        SELECT A.aid
        FROM Actors A
        WHERE A.name = "Brad Pitt"))

---
**Problem 8:** What actor appeared in the most movies grossing over $10 millon dollars?:

SELECT A.name
FROM Actors A
WHERE A.aid in (
    SELECT C.aid
    FROM Cast C
    WHERE C.mid in (SELECT M.mid
        FROM Movies M
        WHERE M.revenue > 10000000)
    GROUP BY C.aid
    ORDER BY COUNT(*) DESC
    LIMIT 1)

---
**Problem 9:** How many movies were released in each year? (Hint: SELECT DISTINCT strftime('%Y',release) FROM Movies)

SELECT strftime('%Y',release), count(strftime('%Y',release))
FROM Movies
GROUP BY strftime('%Y',release)

---
**Problem 10:** What actor-actress pair appear in the most Movies together?

SELECT F.name, M.name
FROM ((SELECT aid, name FROM Actors WHERE gender = "F")
        JOIN Cast USING (aid)) AS F
    JOIN
    ((SELECT aid, name FROM Actors WHERE gender = "M")
        JOIN Cast USING (aid)) AS M
    USING(mid)
GROUP BY F.aid, M.aid
ORDER BY COUNT(*) DESC
LIMIT 1

---
**Problem 11:** What movie has the longest list of cast members?

SELECT M.title
FROM Movies M
WHERE M.mid in (
    SELECT C.mid
    FROM Cast C
    GROUP BY C.mid
    ORDER BY COUNT(*) DESC
    LIMIT 1)

---
**Problem 12:** What actor's movie career has spanned the longest number of years?

SELECT A.name
FROM (Actors JOIN Cast USING (aid)
    JOIN Movies USING (mid)) as A
    JOIN
    (Actors JOIN Cast USING (aid)
    JOIN Movies USING (mid)) as B
    USING(aid)
GROUP BY A.name
ORDER BY MAX(ABS(strftime('%Y%m%d', A.release) - strftime('%Y%m%d', B.release))) DESC
LIMIT 1

Click [here to submit](http://csbio.unc.edu/mcmillan/index.py?run=PS.upload) your completed problem set.

You can submit it as many times as you would like, but only the last submitted version will be graded. If the last submission was after the due date the final score will be reduced accordingly.